Repository: linuxmint/libgksu
Catalog: po/*.po
Languages: ru, th, tr

source: Not using locking for read only lock file %s
ru: Не используется блокировка файлом %s доступного только для чтения
th: จะไม่ใช้การล็อคกับแฟ้ม %s ที่อ่านได้อย่างเดียว
tr: %s salt okunur kilit dosyası için kilitleme kullanılmıyor

source: Not using locking for nfs mounted lock file %s
ru: Не используется блокировка файлом %s на смонтированном разделе с nfs
th: จะไม่ใช้การล็อคกับแฟ้ม %s ที่เมานท์ผ่าน NFS
tr: Nfs bağlanmış %s dosyası için kilitleme kullanılmıyor

source: <b><big>Could not grab your mouse.</big></b> A malicious client may be eavesdropping on your session or you may have just clicked a menu or some application just decided to get focus. Try again.
ru: <b><big>Не удалось захватить управление мышью.</big></b> Возможно, фокус захвачен другим приложением, например, после щелчка по меню, но это может быть и последствием внешнего доступа в систему. Попробуйте ещё раз.
th: <b><big>ไม่สามารถยึดครองเมาส์ได้</big></b> อาจมีบางโปรแกรมที่ไม่ประสงค์ดีกำลังดักข้อมูลการใช้วาระของคุณอยู่ หรือคุณอาจเพิ่งคลิกเมนูไป หรือบางโปรแกรมอาจดึงโฟกัสไป กรุณาลองใหม่
tr: <b><big>Fareniz tutulamadı.</big></b> Zararlı bir istemci oturumunuzu izliyor olabilir, az önce bir menüye tıklamış olabilirsiniz ya da uygulamalardan biri odağı kendi üzerine almış olabilir. Yeniden deneyin.

source: <b><big>Could not grab your keyboard.</big></b> A malicious client may be eavesdropping on your session or you may have just clicked a menu or some application just decided to get focus. Try again.
ru: <b><big>Не удалось захватить управление клавиатурой.</big></b> Возможно, фокус захвачен другим приложением, например, после щелчка по меню, но это может быть и последствием внешнего доступа в систему. Попробуйте ещё раз.
th: <b><big>ไม่สามารถยึดครองแป้นพิมพ์ได้</big></b> อาจมีบางโปรแกรมที่ไม่ประสงค์ดีกำลังดักข้อมูลการใช้วาระของคุณอยู่ หรือคุณอาจเพิ่งคลิกเมนูไป หรือบางโปรแกรมอาจดึงโฟกัสไป กรุณาลองใหม่
tr: <b><big>Klavyeniz tutulamadı.</big></b> Zararlı bir istemci oturumunuzu izliyor olabilir, az önce bir menüye tıklamış olabilirsiniz ya da uygulamalardan biri odağı kendi üzerine almış olabilir. Yeniden deneyin.

source: <b><big>Enter your password to perform administrative tasks</big></b> The application '%s' lets you modify essential parts of your system.
ru: <b><big>Введите пароль для выполнения административных задач</big></b> Приложение «%s» позволит изменить необходимые параметры вашей системы.
th: <b><big>กรุณาป้อนรหัสผ่านของคุณเพื่อทำงานดูแลระบบ</big></b> โปรแกรม '%s' จะเปลี่ยนแปลงแก้ไขส่วนที่สำคัญของระบบ
tr: <b><big>Yönetim görevlerine erişmek için parolanızı girin</big></b> '%s' uygulaması, sisteminizin temel bölümlerinde değişiklik yapmanızı sağlar.

source: <b><big>Enter your password to run the application '%s' as user %s</big></b>
ru: <b><big>Введите ваш пароль для запуска приложения «%s» с правами пользователя %s</big></b>
th: <b><big>กรุณาป้อนรหัสผ่านของคุณเพื่อเรียกโปรแกรม '%s' ในนามของผู้ใช้ %s</big></b>
tr: <b><big>'%s' uygulamasını, %s kullanıcısı olarak çalıştırmak için parolanızı girin</big></b>

source: <b><big>Enter the administrative password</big></b> The application '%s' lets you modify essential parts of your system.
ru: <b><big>Введите административный пароль</big></b> Приложение «%s» позволит изменить необходимые параметры вашей системы.
th: <b><big>กรุณาป้อนรหัสผ่านของผู้ดูแลระบบ</big></b> โปรแกรม '%s' จะเปลี่ยนแปลงแก้ไขส่วนที่สำคัญของระบบ
tr: <b><big>Yönetici parolasını girin</big></b> '%s' uygulaması, sisteminizin temel bölümlerinde değişiklik yapmanızı sağlar.

source: <b><big>Enter the password of %s to run the application '%s'</big></b>
ru: <b><big>Введите пароль пользователя %s для запуска приложения «%s»</big></b>
th: <b><big>กรุณาป้อนรหัสผ่านของ %s เพื่อเรียกโปรแกรม '%s'</big></b>
tr: <b><big>'%s' uygulamasını çalıştırmak için %s kullanıcısının parolasını girin</big></b>

source: Password prompt canceled.
ru: Запрос пароля снят.
th: คำถามถามรหัสผ่านถูกยกเลิก
tr: Parola istemi iptal edildi.

source: <b><big>Granted permissions without asking for password</big></b> The '%s' program was started with the privileges of the %s user without the need to ask for a password, due to your system's authentication mechanism setup. It is possible that you are being allowed to run specific programs as user %s without the need for a password, or that the password is cached. This is not a problem report; it's simply a notification to make sure you are aware of this.
ru: <b><big>Предоставление прав без запроса пароля</big></b> Программа «%s» запущена с правами пользователя %s без запроса пароля согласно настройкам аутентификации в системе. Это возможно, если вам разрешено запускать конкретные программы с правами пользователя %s без необходимости ввода пароля или из-за того, что пароль кэшируется. Это не сообщение о проблеме, а просто уведомление, чтобы вы знали об этом.
th: <b><big>ได้รับอนุญาตโดยไม่ได้ถามรหัสผ่าน</big></b> โปรแกรม '%s' ถูกเรียกโดยได้รับสิทธิ์ของผู้ใช้ %s โดยไม่จำเป็นต้องถามรหัสผ่าน ตามกระบวนการยืนยันตัวบุคคลที่ได้ตั้งไว้ในระบบของคุณ เป็นไปได้ว่าคุณจะได้รับอนุญาตให้เรียกโปรแกรมบางโปรแกรมในนามของผู้ใช้ %s ได้ โดยไม่จำเป็นต้องใช้รหัสผ่าน หรือมิฉะนั้น รหัสผ่านก็อาจถูกจำไว้ในระบบ ข้อความนี้ไม่ใช่การรายงานปัญหา แต่เป็นการแจ้งเพื่อให้แน่ใจว่าคุณทราบถึงเงื่อนไขนี้
tr: <b><big>İzinler, parola sorulmadan elde edildi</big></b> '%s' uygulaması, %s kullanıcısının yetkileriyle, sisteminizin doğrulama düzeneği ayarları nedeniyle parola sorma ihtiyacı hissedilmeden başlatıldı. Belirli bir uygulamayı %s kullanıcısı olarak, parola ihtiyacı olmadan ya da bellekteki parolayla başlatmanız mümkündür. Bu bir sorun raporu değil, durumun farkında olduğunuzdan emin olmak için gösterilen basit bir bildirimdir.

source: Do _not display this message again
ru: Не _выводить это сообщение в следующий раз
th: ไ_ม่ต้องแสดงข้อความนี้อีก
tr: Bu iletiyi bir daha _gösterme

source: <b>Would you like your screen to be "grabbed" while you enter the password?</b> This means all applications will be paused to avoid the eavesdropping of your password by a a malicious application while you type it.
ru: <b>«Захватить» экран на время ввода пароля?</ b> Это означает, что все приложения будут приостановлены, чтобы избежать подслушивания вашего пароля при вводе с применением вредоносных программ.
th: <b>คุณต้องการให้ "ยึดครอง" หน้าจอขณะที่ป้อนรหัสผ่านหรือไม่?</b> การยึดครองดังกล่าว จะทำให้โปรแกรมทั้งหมดหยุดทำงานชั่วคราว เพื่อป้องกันโปรแกรมที่ไม่ประสงค์ดีดักจับรหัสผ่านขณะที่คุณพิมพ์
tr: <b>Ekranınızın, parolanızı girerken "tutulu" olmasını ister misiniz?</b> Bu, kötü niyetli uygulamaların gizlice parolanızı görmelerine engel olmak amacıyla, parolanızı girerken tüm uygulamaların dondurulacağı anlamına gelmektedir.

source: Granting Rights
ru: Предоставление прав
th: กำลังอนุญาตสิทธิ์
tr: Bahsetme Hakkı

source: Starting Administrative Application
ru: Запуск административного приложения
th: เริ่มต้น
tr: Yönetim Uygulaması Başlatılıyor

source: gksu_run needs a command to be run, none was provided.
ru: Программа gksu_run не получила команду, которую нужно выполнить.
th: gksu_run ต้องระบุคำสั่งที่จะเรียกทำงานด้วย ซึ่งไม่มี
tr: gksu_run'ın çalıştıracağı komutun belirtimesi gerekiyor fakat belirtilmemiş.

source: The gksu-run-helper command was not found or is not executable.
ru: Команда gksu-run-helper не существует или не может быть выполнена.
th: ไม่พบคำสั่ง gksu-run-helper หรือเรียกทำงานไม่ได้
tr: gksu-run-helper komutu bulunamadı ya da çalıştırılabilir değil.

source: Unable to copy the user's Xauthorization file.
ru: Невозможно скопировать пользовательский файл X-авторизации.
th: ไม่สามารถคัดลอกแฟ้ม Xauthorization ของผู้ใช้
tr: Kullanıcının Xauthorization dosyası kopyalanamıyor.

source: Failed to fork new process: %s
ru: Не удалось создать новый процесс: %s
th: ไม่สามารถ fork โพรเซสใหม่: %s
tr: Yeni işleç oluşturulamadı : %s

source: Wrong password got from keyring.
ru: Получен неверный пароль из брелка.
th: ได้รับรหัสผ่านที่ผิดจากพวงกุญแจ
tr: Anahtarlıktan yanlış parola alındı.

source: Wrong password.
ru: Неверный пароль.
th: รหัสผ่านผิด
tr: Yanlış parola.

source: Failed to communicate with gksu-run-helper. Received: %s While expecting: %s
ru: Не удалось соединиться с gksu-run-helper. Получено: %s Ожидается: %s
th: ติดต่อสื่อสารกับ gksu-run-helper ไม่สำเร็จ ได้รับ: %s แต่ต้องการ: %s
tr: gksu-run-helper ile haberleşme başarısız oldu Şu beklenirken: %2$s Şu alındı: %1$s

source: Failed to communicate with gksu-run-helper. Received bad string while expecting: %s
ru: Не удалось соединиться с gksu-run-helper. Получена неправильная строка при ожидании: %s
th: ติดต่อสื่อสารกับ gksu-run-helper ไม่สำเร็จ ได้รับสตริงที่ไม่ถูกต้อง ในขณะที่ต้องการ: %s
tr: gksu-run-helper ile iletişim başarısız oldu. Şu beklenirken bozuk dizgi alındı: %s

source: su terminated with %d status
ru: выполнение su прекращено со статусом %d
th: su จบการทำงานด้วยสถานะ %d
tr: su %d durumu ile sonlandı

source: gksu_sudo_run needs a command to be run, none was provided.
ru: Программа gksu_sudo_run не получила команду, которую нужно запустить.
th: gksu_sudo_run ต้องระบุคำสั่งที่จะเรียกทำงานด้วย ซึ่งไม่มี
tr: gksu_sudo_run'ın çalıştıracağı komutun belirtilmesi gerekiyor fakat belirtilmemiş.

source: Error creating pipe: %s
ru: Ошибка при создании канала: %s
th: เกิดข้อผิดพลาดขณะสร้างไปป์: %s
tr: %s borusu oluşturulurken hata oluştu.

source: Failed to exec new process: %s
ru: Не удалось запустить новый процесс: %s
th: ไม่สามารถ exec โพรเซสใหม่: %s
tr: Yeni %s işlemi yürütülürken hata oluştu.

source: Error opening pipe: %s
ru: Ошибка при открытии канала: %s
th: เกิดข้อผิดพลาดขณะเปิดไปป์: %s
tr: %s borusu açılırken hata oluştu.

source: Password:
ru: Пароль:
th: รหัสผ่าน:
tr: Parola:

source: The underlying authorization mechanism (sudo) does not allow you to run this program. Contact the system administrator.
ru: Система авторизации (sudo) не позволяет запускать данную программу. Обратитесь к системному администратору.
th: กลไกการยืนยันตัวบุคคลที่ใช้ (sudo) ไม่อนุญาตให้คุณเรียกใช้โปรแกรมนี้ กรุณาติดต่อผู้ดูแลระบบ
tr: Arkaplanda çalışan doğrulama düzeneği (sudo), bu uygulamayı çalıştırmanıza izin vermiyor. Sistem yöneticinizle iletişim kurun.

source: sudo terminated with %d status
ru: Программа sudo завершилась с кодом %d
th: sudo จบการทำงานด้วยสถานะ %d
tr: sudo %d durumu ile sonlandı

source: <b>You have capslock on</b>
ru: <b>Нажата клавиша CapsLock</b>
th: <b>ปุ่ม CapsLock ติดอยู่</b>
tr: <b>Capslock açık durumda</b>

source: Remember password
ru: Запомнить пароль
th: จำรหัสผ่าน
tr: Parolayı hatırla

source: Save for this session
ru: Сохранить для этого сеанса
th: จำไว้ใช้ตลอดวาระนี้
tr: Bu oturum için kaydet

source: Save in the keyring
ru: Сохранить в брелок
th: เก็บเข้าพวงกุญแจ
tr: Anahtarlığa kaydet

source: <span weight="bold" size="larger">Type the root password.</span>
ru: <span weight="bold" size="larger">Введите пароль root.</span>
th: <span weight="bold" size="larger">กรุณาป้อนรหัสผ่านของ root</span>
tr: <span weight="bold" size="larger">Yönetici parolasını girin.</span>

source: Password:
ru: Пароль:
th: รหัสผ่าน:
tr: Parola:

source: Failed to load gtkui file; please check your installation.
ru: Не удалось загрузить файл gtkui, проверьте правильность установки пакета.
tr: gtkui dosyası yüklenemedi; lütfen kurulumunuzu kontrol edin.

source: Privilege granting
ru: Предоставляемые привилегии
th: การอนุญาตสิทธิ์พิเศษ
tr: Ayrıcalık tahsisi

source: Configure behavior of the privilege-granting tool
ru: Настройка поведения из утилиты предоставления привилегий
th: ตั้งค่าพฤติกรรมของเครื่องมืออนุญาตสิทธิ์พิเศษ
tr: Ayrıcalık-tahsis aracının davranışını yapılandırın

source: enable
ru: включить
tr: etkinleştir

source: disable
ru: отключить
tr: devre dışı bırak

source: force enable
ru: включить принудительно
tr: zorla etkinleştir

source: prompt
ru: запрос
tr: İstemci

source: _Authentication mode:
ru: Режим _аутентификации:
th: รูปแบบการยืนยัน_ตัวบุคคล:
tr: _Doğrulama kipi:

source: _Grab mode:
ru: Режим _захвата:
th: รูปแบบการยึด_ครอง:
tr: _Tutma kipi:

source: <b>Screen Grabbing</b>
ru: <b>Захват экрана</b>
th: <b>การยึดครองหน้าจอ</b>
tr: Ekran Tutma

source: <b>Behavior</b>
ru: <b>Поведение</b>
th: <b>พฤติกรรม</b>
tr: <b>Davranış</b>

source: Disable keyboard and mouse grab
ru: Отключить захват клавиатуры и мыши
th: ปิดการยึดครองแป้นพิมพ์และเมาส์
tr: Klavye ve fare tutmayı engelle

source: Whether the keyboard and mouse grabbing should be turned off. This will make it possible for other X applications to listen to keyboard input events, thus making it not possible to shield from malicious applications which may be running.
ru: Определяет, будет ли отключён захват клавиатуры и мыши. Это может привести к несанкционированному получению вводимых с клавиатуры данных другими графическими приложениями, что приведёт к невозможности защиты от вредоносных программ, которые могут быть запущены в этот момент.
th: กำหนดว่าจะปิดการยึดครองแป้นพิมพ์และเมาส์หรือไม่ การปิดนี้จะเป็นการเปิดโอกาสให้โปรแกรม X อื่นดักเหตุการณ์การกดแป้นพิมพ์ได้ ซึ่งจะทำให้ไม่สามารถป้องกันโปรแกรมที่ไม่ประสงค์ดีที่อาจทำงานอยู่ได้
tr: Klavye ve fare tutulmasının kapatılıp kapatılmayacağı. Bu diğer X uygulamalarının klavye giriş olaylarını dinlemelerini sağlar, ancak aynı zamanda çalışmakta olabilecek kötü niyetli uygulamalara karşı korunmayı da imkansız kılar.

source: Force keyboard and mouse grab
ru: Принудительно захватить клавиатуру и мышь
th: บังคับยึดครองแป้นพิมพ์และเมาส์
tr: Klavye ve fare tutmaya zorla

source: Grab keyboard and mouse even if -g has been passed as argument on the command line.
ru: Захватывать клавиатуру и мышь, даже если в командной строке присутствует аргумент «-g».
th: ยึดครองแป้นพิมพ์และเมาส์เสมอ แม้จะระบุตัวเลือก -g ในบรรทัดคำสั่ง
tr: Komut satırında -g argümanı verilmiş olsa bile klavye ve fareyi tut.

source: Sudo mode
ru: Режим sudo
th: โหมด sudo
tr: Sudo kipi

source: Whether sudo should be the default backend method. This method is otherwise accessed though the -S switch or by running 'gksudo' instead of 'gksu'.
ru: Определяет, будет ли sudo использоваться как метод аутентификации по умолчанию. Также метод можно задать с помощью параметра -S или запустив «gksudo» вместо «gksu».
th: กำหนดว่า จะใช้ sudo เป็นวิธีปริยายหรือไม่ หากไม่กำหนด ก็ยังสามารถเรียกใช้วิธีนี้ได้ ผ่านตัวเลือก -S หรือโดยเรียกคำสั่ง 'gksudo' แทน 'gksu'
tr: Sudo varsayılan yetki tahsis metodu olarak kullanılsın mı? Seçili olmadığında sudo metodunu kullanmak için -S parametresini kullanmalı veya 'gksu' yerine 'gksudo'yu çalıştırmalısınız.

source: Prompt for grabbing
ru: Запрос на захват
th: ถามการยึดครอง
tr: Tutulup tutulmayacığını sor

source: This option will make gksu prompt the user if he wants to have the screen grabbed before entering the password. Notice that this only has an effect if force-grab is disabled.
ru: Этот параметр заставит gksu вывести пользователю запрос о захвате экрана перед вводом пароля. Заметим, что это происходит только если не указан параметр принудительного захвата (force-grab).
th: ตัวเลือกนี้จะทำให้ gksu ถามผู้ใช้ว่าต้องการให้ยึดครองหน้าจอหรือไม่ ก่อนที่จะป้อนรหัสผ่าน สังเกตว่าค่านี้จะมีผลก็ต่อเมื่อตัวเลือก force-grab ปิดอยู่เท่านั้น
tr: Bu seçenek gksu'nun, kullanıcının parola girmeden önce ekranın tutulmasını isteyip istemediğini sormasını sağlar. Bu seçenek ancak "tutmaya zorla" devredışı ise etki edecektir.

source: Display information message when no password is needed
ru: Вывести сообщение, если не требуется ввод пароля
th: แสดงข้อความแจ้งเตือนเมื่อไม่จำเป็นต้องใช้รหัสผ่าน
tr: Şifre gerekmediğinde bilgi mesajı görüntüle

source: This option determines whether a message dialog will be displayed informing the user that the program is being run without the need of a password being asked for some reason.
ru: Этот параметр определяет будет ли показано диалоговое окно, информирующее пользователя о том, что программа выполнятся без запроса пароля по некоторой причине.
th: กำหนดว่าจะแสดงกล่องข้อความเพื่อแจ้งให้ผู้ใช้ทราบหรือไม่ ว่ากำลังจะเรียกโปรแกรมโดยไม่จำเป็นต้องถามรหัสผ่านด้วยเหตุผลบางประการ
tr: Bu seçenek, programın herhangi bir nedenle parola sormaya ihtiyaç duymaksızın çalıştırıldığını kullanıcıya belirten bir mesaj penceresi gösterilip gösterilmeyeceğini ayarlar

source: Save password to gnome-keyring
ru: Сохранить пароль в gnome-keyring
th: เก็บรหัสผ่านใน gnome-keyring
tr: Parolayı gnome-keyring'e kaydet

source: gksu can save the password you type to the gnome-keyring so you'll not be asked everytime
ru: gksu может сохранить набранный пароль в gnome-keyring, таким образом пользователю не надо будет вводить его каждый раз.
th: gksu สามารถเก็บรหัสผ่านที่คุณป้อนเข้าใน gnome-keyring ได้ เพื่อที่คุณจะไม่ต้องป้อนรหัสผ่านทุกครั้ง
tr: gksu, her seferinde size sormamak için yazdığınız parolayı gnome-keyring içine kaydedebilir.

source: Keyring to which passwords will be saved
ru: Брелок, в котором будут храниться пароли
th: พวงกุญแจที่จะใช้เก็บรหัสผ่าน
tr: Parolaların saklanacağı anahtarlık

source: The name of the keyring gksu should use. Usual values are "session", which saves the password for the session, and "default", which saves the password with no timeout.
ru: gksu использует названия брелока для своей работы. Обычно встречается название «session», такой брелок хранит пароли на время открытого сеанса. Также применяется брелок «default», в нём хранятся пароли в независимости от продолжительности сеанса.
th: ชื่อของพวงกุญแจที่จะให้ gksu ใช้ ค่าโดยทั่วไปคือ "session" ซึ่งจะเก็บรหัสผ่านไว้ใช้จนจบวาระ และ "default" ซึ่งจะเก็บรหัสผ่านโดยไม่มีกำหนดหมดอายุ
tr: gksu tarafından kullanılacak olan anahtarlığın adı. Genelde kullanılan değerler, parolayı oturum için kaydeden "session", ve parolayı zaman aşımı olmaksızın kaydeden "default" değerleridir.

source: Failed to obtain xauth key: xauth binary not found at usual locations
ru: Не удалось получить ключ xauth: xauth не был найден в месте своего расположения.
th: ไม่สามารถดึงกุญแจ xauth: ไม่พบแฟ้มโปรแกรม xauth ในตำแหน่งปกติ
tr: xauth anahtarı elde edilemedi: xauth ikili dosyası olağan konumlarında bulunamadı
